#### [`repos`] Terraform Plan 📖`failure`



<details><summary>Show Plan</summary>

```tf
github_repository.cdktn-provider-null-go_repo_02352A63: Refreshing state... [id=cdktn-provider-null-go]
github_repository.cdktn-provider-github-go_repo_A6D73E4B: Refreshing state... [id=cdktn-provider-github-go]
github_repository.cdktn-provider-docker-go_repo_9A3A386A: Refreshing state... [id=cdktn-provider-docker-go]
github_repository.cdktn-provider-github_repo_4B89F268: Refreshing state... [id=cdktn-provider-github]
github_repository.cdktn-provider-archive_repo_7B884DD9: Refreshing state... [id=cdktn-provider-archive]
data.github_team.cdktn-team-cdk-terrain: Reading...
github_repository.cdktn-provider-time-go_repo_65B9A223: Refreshing state... [id=cdktn-provider-time-go]
github_repository.cdktn-provider-local_repo_5CE00778: Refreshing state... [id=cdktn-provider-local]
github_repository.cdktn-provider-archive-go_repo_C3623732: Refreshing state... [id=cdktn-provider-archive-go]
github_repository.cdktn-provider-external_repo_1F85962F: Refreshing state... [id=cdktn-provider-external]
github_repository.cdktn-provider-random_repo_D20F5E27: Refreshing state... [id=cdktn-provider-random]
github_repository.cdktn-provider-time_repo_3B2224F9: Refreshing state... [id=cdktn-provider-time]
github_repository.cdktn-provider-null_repo_41CFF515: Refreshing state... [id=cdktn-provider-null]
github_repository.cdktn-provider-aws-go_repo_ACB9DC46: Refreshing state... [id=cdktn-provider-aws-go]
github_repository.cdktn-provider-kubernetes-go_repo_080C5E07: Refreshing state... [id=cdktn-provider-kubernetes-go]
github_repository.cdktn-provider-tls_repo_49C93FD1: Refreshing state... [id=cdktn-provider-tls]
github_repository.cdktn-provider-cloudinit_repo_8DDE9C9A: Refreshing state... [id=cdktn-provider-cloudinit]
github_repository.cdktn-provider-external-go_repo_5D8292C3: Refreshing state... [id=cdktn-provider-external-go]
github_repository.cdktn-provider-cloudinit-go_repo_E4B4E62B: Refreshing state... [id=cdktn-provider-cloudinit-go]
github_repository.cdktn-provider-tls-go_repo_62EFE93C: Refreshing state... [id=cdktn-provider-tls-go]
github_repository.cdktn-provider-random-go_repo_59AE4131: Refreshing state... [id=cdktn-provider-random-go]
github_repository.cdktn-provider-project_repo_11A4EE37: Refreshing state... [id=cdktn-provider-project]
github_repository.cdktn-repository-manager_repo_638CE96A: Refreshing state... [id=cdktn-repository-manager]
github_repository.cdktn-provider-docker_repo_B5F1E60F: Refreshing state... [id=cdktn-provider-docker]
github_repository.cdktn-provider-kubernetes_repo_A94DB71E: Refreshing state... [id=cdktn-provider-kubernetes]
github_repository.cdktn-provider-local-go_repo_F7B01B52: Refreshing state... [id=cdktn-provider-local-go]
github_repository.cdktn-provider-aws_repo_45EAAAF4: Refreshing state... [id=cdktn-provider-aws]
github_issue_label.cdktn-provider-null-go_repository-setup_auto-approve-label_5B49DE44: Refreshing state... [id=cdktn-provider-null-go:auto-approve]
github_issue_label.cdktn-provider-null-go_repository-setup_automerge-label_A70E48C7: Refreshing state... [id=cdktn-provider-null-go:automerge]
github_issue_label.cdktn-provider-null-go_repository-setup_no-auto-close-label_668E7AA1: Refreshing state... [id=cdktn-provider-null-go:no-auto-close]
github_repository_webhook.cdktn-provider-null-go_repository-setup_slack-webhook_E0569928: Refreshing state... [id=591040415]
github_actions_secret.cdktn-provider-archive_repo_secret-gh-app-private-key-alias-PROJEN_APP_PRIVATE_KEY_5B0D44DC: Refreshing state... [id=cdktn-provider-archive:PROJEN_APP_PRIVATE_KEY]
github_actions_secret.cdktn-provider-archive_repo_secret-npm-token_9A435341: Refreshing state... [id=cdktn-provider-archive:NPM_TOKEN]
github_actions_secret.cdktn-provider-archive_repo_secret-twine-password_F0BBCEF9: Refreshing state... [id=cdktn-provider-archive:TWINE_PASSWORD]
github_actions_secret.cdktn-provider-archive_repo_secret-gh-app-id_B21F6EA0: Refreshing state... [id=cdktn-provider-archive:GH_APP_ID]
github_actions_secret.cdktn-provider-archive_repo_secret-gh-app-id-alias-PROJEN_APP_ID_42567B52: Refreshing state... [id=cdktn-provider-archive:PROJEN_APP_ID]
data.github_team.cdktn-team-cdk-terrain: Still reading... [00m10s elapsed]
github_repository_dependabot_security_updates.cdktn-provider-archive_dependabot-security_21960F87: Refreshing state... [id=cdktn-provider-archive]
github_actions_secret.cdktn-provider-archive_repo_secret-alert-prs-slack-webhook-url_3EAA76B3: Refreshing state... [id=cdktn-provider-archive:ALERT_PRS_SLACK_WEBHOOK_URL]
github_actions_secret.cdktn-provider-archive_repo_secret-twine-username_3FB41B86: Refreshing state... [id=cdktn-provider-archive:TWINE_USERNAME]
github_actions_secret.cdktn-provider-archive_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_5CD9DE70: Refreshing state... [id=cdktn-provider-archive:PROJEN_GITHUB_TOKEN]
github_issue_label.cdktn-provider-archive_repository-setup_auto-approve-label_204DFCFD: Refreshing state... [id=cdktn-provider-archive:auto-approve]
github_branch_protection.cdktn-provider-archive_repository-setup_main-protection_A70F5F26: Refreshing state... [id=BPR_kwDOQ3xwWc4EQ9_4]
github_repository_webhook.cdktn-provider-archive_repository-setup_slack-webhook_0B97B2DB: Refreshing state... [id=591037620]
github_actions_secret.cdktn-provider-archive_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_044A657A: Refreshing state... [id=cdktn-provider-archive:GO_GITHUB_TOKEN]
github_actions_secret.cdktn-provider-archive_repo_secret-gh-app-private-key_1B91EF11: Refreshing state... [id=cdktn-provider-archive:GH_APP_PRIVATE_KEY]
github_issue_label.cdktn-provider-archive_repository-setup_automerge-label_2CD033FE: Refreshing state... [id=cdktn-provider-archive:automerge]
github_actions_secret.cdktn-provider-archive_repo_secret-gh-token_BCE9E69C: Refreshing state... [id=cdktn-provider-archive:GH_TOKEN]
github_issue_label.cdktn-provider-archive_repository-setup_no-auto-close-label_E651E719: Refreshing state... [id=cdktn-provider-archive:no-auto-close]
github_issue_label.cdktn-provider-github_repository-setup_auto-approve-label_F31E4AA9: Refreshing state... [id=cdktn-provider-github:auto-approve]
github_actions_secret.cdktn-provider-github_repo_secret-npm-token_70F151CF: Refreshing state... [id=cdktn-provider-github:NPM_TOKEN]
github_repository_dependabot_security_updates.cdktn-provider-github_dependabot-security_45783950: Refreshing state... [id=cdktn-provider-github]
github_actions_secret.cdktn-provider-github_repo_secret-alert-prs-slack-webhook-url_BE220BE0: Refreshing state... [id=cdktn-provider-github:ALERT_PRS_SLACK_WEBHOOK_URL]
github_repository_webhook.cdktn-provider-github_repository-setup_slack-webhook_44AD911A: Refreshing state... [id=591113956]
github_actions_secret.cdktn-provider-github_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_634E972C: Refreshing state... [id=cdktn-provider-github:GO_GITHUB_TOKEN]
github_actions_secret.cdktn-provider-github_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_DD70ECC4: Refreshing state... [id=cdktn-provider-github:PROJEN_GITHUB_TOKEN]
github_actions_secret.cdktn-provider-github_repo_secret-gh-app-private-key-alias-PROJEN_APP_PRIVATE_KEY_957A5DDF: Refreshing state... [id=cdktn-provider-github:PROJEN_APP_PRIVATE_KEY]
github_issue_label.cdktn-provider-github_repository-setup_automerge-label_963AD16B: Refreshing state... [id=cdktn-provider-github:automerge]
github_branch_protection.cdktn-provider-github_repository-setup_main-protection_4537DA4A: Refreshing state... [id=BPR_kwDOQ4BD5M4ERA3M]
github_actions_secret.cdktn-provider-github_repo_secret-gh-app-private-key_2B8A47BB: Refreshing state... [id=cdktn-provider-github:GH_APP_PRIVATE_KEY]
github_actions_secret.cdktn-provider-github_repo_secret-gh-token_173F27DC: Refreshing state... [id=cdktn-provider-github:GH_TOKEN]
github_actions_secret.cdktn-provider-github_repo_secret-twine-password_4C2ED484: Refreshing state... [id=cdktn-provider-github:TWINE_PASSWORD]
github_actions_secret.cdktn-provider-github_repo_secret-gh-app-id-alias-PROJEN_APP_ID_E92E2704: Refreshing state... [id=cdktn-provider-github:PROJEN_APP_ID]
github_issue_label.cdktn-provider-github_repository-setup_no-auto-close-label_AA309BC9: Refreshing state... [id=cdktn-provider-github:no-auto-close]
github_actions_secret.cdktn-provider-github_repo_secret-gh-app-id_207FF949: Refreshing state... [id=cdktn-provider-github:GH_APP_ID]
github_actions_secret.cdktn-provider-github_repo_secret-twine-username_86A42CCA: Refreshing state... [id=cdktn-provider-github:TWINE_USERNAME]
github_issue_label.cdktn-provider-github-go_repository-setup_no-auto-close-label_12F33B9A: Refreshing state... [id=cdktn-provider-github-go:no-auto-close]
github_repository_webhook.cdktn-provider-github-go_repository-setup_slack-webhook_6125BB66: Refreshing state... [id=591115072]
github_issue_label.cdktn-provider-github-go_repository-setup_auto-approve-label_2EAFCBC3: Refreshing state... [id=cdktn-provider-github-go:auto-approve]
github_issue_label.cdktn-provider-github-go_repository-setup_automerge-label_2A2E3DC3: Refreshing state... [id=cdktn-provider-github-go:automerge]
github_issue_label.cdktn-provider-docker-go_repository-setup_no-auto-close-label_2FE8640F: Refreshing state... [id=cdktn-provider-docker-go:no-auto-close]
github_issue_label.cdktn-provider-docker-go_repository-setup_auto-approve-label_2AEC183E: Refreshing state... [id=cdktn-provider-docker-go:auto-approve]
github_repository_webhook.cdktn-provider-docker-go_repository-setup_slack-webhook_4B49198B: Refreshing state... [id=591037839]
github_issue_label.cdktn-provider-docker-go_repository-setup_automerge-label_0CE340E9: Refreshing state... [id=cdktn-provider-docker-go:automerge]
github_actions_secret.cdktn-provider-local_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_9B0179ED: Refreshing state... [id=cdktn-provider-local:PROJEN_GITHUB_TOKEN]
github_issue_label.cdktn-provider-local_repository-setup_auto-approve-label_2E1EF9AE: Refreshing state... [id=cdktn-provider-local:auto-approve]
github_issue_label.cdktn-provider-local_repository-setup_automerge-label_3DC058F1: Refreshing state... [id=cdktn-provider-local:automerge]
github_actions_secret.cdktn-provider-local_repo_secret-gh-app-id-alias-PROJEN_APP_ID_9A08252D: Refreshing state... [id=cdktn-provider-local:PROJEN_APP_ID]
github_branch_protection.cdktn-provider-local_repository-setup_main-protection_39DBEEB8: Refreshing state... [id=BPR_kwDOQ3yZ484EQ-ER]
github_actions_secret.cdktn-provider-local_repo_secret-twine-password_78A163F4: Refreshing state... [id=cdktn-provider-local:TWINE_PASSWORD]
github_actions_secret.cdktn-provider-local_repo_secret-twine-username_54303DFE: Refreshing state... [id=cdktn-provider-local:TWINE_USERNAME]
github_actions_secret.cdktn-provider-local_repo_secret-gh-app-id_48B58B53: Refreshing state... [id=cdktn-provider-local:GH_APP_ID]
github_repository_webhook.cdktn-provider-local_repository-setup_slack-webhook_B61D6ACD: Refreshing state... [id=591040180]
github_actions_secret.cdktn-provider-local_repo_secret-gh-app-private-key_F414B5B0: Refreshing state... [id=cdktn-provider-local:GH_APP_PRIVATE_KEY]
github_actions_secret.cdktn-provider-local_repo_secret-gh-token_75E8C781: Refreshing state... [id=cdktn-provider-local:GH_TOKEN]
github_actions_secret.cdktn-provider-local_repo_secret-gh-app-private-key-alias-PROJEN_APP_PRIVATE_KEY_CB6B045A: Refreshing state... [id=cdktn-provider-local:PROJEN_APP_PRIVATE_KEY]
github_issue_label.cdktn-provider-local_repository-setup_no-auto-close-label_DA48194A: Refreshing state... [id=cdktn-provider-local:no-auto-close]
github_repository_dependabot_security_updates.cdktn-provider-local_dependabot-security_ACAB7A25: Refreshing state... [id=cdktn-provider-local]
github_actions_secret.cdktn-provider-local_repo_secret-npm-token_D443836E: Refreshing state... [id=cdktn-provider-local:NPM_TOKEN]
data.github_team.cdktn-team-cdk-terrain: Still reading... [00m20s elapsed]
github_actions_secret.cdktn-provider-local_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_A6BDAC50: Refreshing state... [id=cdktn-provider-local:GO_GITHUB_TOKEN]
github_actions_secret.cdktn-provider-local_repo_secret-alert-prs-slack-webhook-url_EE4858D3: Refreshing state... [id=cdktn-provider-local:ALERT_PRS_SLACK_WEBHOOK_URL]
github_actions_secret.cdktn-provider-external_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_A3BBBCD5: Refreshing state... [id=cdktn-provider-external:GO_GITHUB_TOKEN]
github_actions_secret.cdktn-provider-external_repo_secret-gh-app-id_99E659EE: Refreshing state... [id=cdktn-provider-external:GH_APP_ID]
github_branch_protection.cdktn-provider-external_repository-setup_main-protection_B22DC5DC: Refreshing state... [id=BPR_kwDOQ3x1v84EQ9_5]
github_actions_secret.cdktn-provider-external_repo_secret-twine-username_AD14AA31: Refreshing state... [id=cdktn-provider-external:TWINE_USERNAME]
github_actions_secret.cdktn-provider-external_repo_secret-gh-app-private-key-alias-PROJEN_APP_PRIVATE_KEY_377F81AA: Refreshing state... [id=cdktn-provider-external:PROJEN_APP_PRIVATE_KEY]
github_actions_secret.cdktn-provider-external_repo_secret-twine-password_EC6F6175: Refreshing state... [id=cdktn-provider-external:TWINE_PASSWORD]
github_actions_secret.cdktn-provider-external_repo_secret-npm-token_320A2EF6: Refreshing state... [id=cdktn-provider-external:NPM_TOKEN]
github_repository_webhook.cdktn-provider-external_repository-setup_slack-webhook_F94A1CC0: Refreshing state... [id=591037651]
github_issue_label.cdktn-provider-external_repository-setup_auto-approve-label_1B958A29: Refreshing state... [id=cdktn-provider-external:auto-approve]
github_issue_label.cdktn-provider-external_repository-setup_no-auto-close-label_BF795ED8: Refreshing state... [id=cdktn-provider-external:no-auto-close]
github_actions_secret.cdktn-provider-external_repo_secret-gh-token_0E8824B7: Refreshing state... [id=cdktn-provider-external:GH_TOKEN]
github_actions_secret.cdktn-provider-external_repo_secret-alert-prs-slack-webhook-url_BB647440: Refreshing state... [id=cdktn-provider-external:ALERT_PRS_SLACK_WEBHOOK_URL]
github_issue_label.cdktn-provider-external_repository-setup_automerge-label_24C8E67C: Refreshing state... [id=cdktn-provider-external:automerge]
github_repository_dependabot_security_updates.cdktn-provider-external_dependabot-security_38FBBB82: Refreshing state... [id=cdktn-provider-external]
github_actions_secret.cdktn-provider-external_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_A078A8A5: Refreshing state... [id=cdktn-provider-external:PROJEN_GITHUB_TOKEN]
github_actions_secret.cdktn-provider-external_repo_secret-gh-app-id-alias-PROJEN_APP_ID_8D15D30D: Refreshing state... [id=cdktn-provider-external:PROJEN_APP_ID]
github_actions_secret.cdktn-provider-external_repo_secret-gh-app-private-key_D5692F82: Refreshing state... [id=cdktn-provider-external:GH_APP_PRIVATE_KEY]
github_repository_webhook.cdktn-provider-time-go_repository-setup_slack-webhook_7453EFA2: Refreshing state... [id=591040481]
github_issue_label.cdktn-provider-time-go_repository-setup_automerge-label_00C85817: Refreshing state... [id=cdktn-provider-time-go:automerge]
github_issue_label.cdktn-provider-time-go_repository-setup_auto-approve-label_65C266B3: Refreshing state... [id=cdktn-provider-time-go:auto-approve]
github_issue_label.cdktn-provider-time-go_repository-setup_no-auto-close-label_9DDC870D: Refreshing state... [id=cdktn-provider-time-go:no-auto-close]
github_issue_label.cdktn-provider-archive-go_repository-setup_no-auto-close-label_F4064D97: Refreshing state... [id=cdktn-provider-archive-go:no-auto-close]
github_issue_label.cdktn-provider-archive-go_repository-setup_automerge-label_2FA0E2DD: Refreshing state... [id=cdktn-provider-archive-go:automerge]
github_repository_webhook.cdktn-provider-archive-go_repository-setup_slack-webhook_8D783473: Refreshing state... [id=591037912]
github_issue_label.cdktn-provider-archive-go_repository-setup_auto-approve-label_1A1597FB: Refreshing state... [id=cdktn-provider-archive-go:auto-approve]
github_actions_secret.cdktn-provider-random_repo_secret-gh-app-id_F6E38709: Refreshing state... [id=cdktn-provider-random:GH_APP_ID]
github_actions_secret.cdktn-provider-random_repo_secret-gh-app-private-key_5452AE71: Refreshing state... [id=cdktn-provider-random:GH_APP_PRIVATE_KEY]
github_actions_secret.cdktn-provider-random_repo_secret-npm-token_A7D5D73C: Refreshing state... [id=cdktn-provider-random:NPM_TOKEN]
github_actions_secret.cdktn-provider-random_repo_secret-gh-app-private-key-alias-PROJEN_APP_PRIVATE_KEY_53F1A759: Refreshing state... [id=cdktn-provider-random:PROJEN_APP_PRIVATE_KEY]
github_actions_secret.cdktn-provider-random_repo_secret-alert-prs-slack-webhook-url_A6A0C34B: Refreshing state... [id=cdktn-provider-random:ALERT_PRS_SLACK_WEBHOOK_URL]
github_issue_label.cdktn-provider-random_repository-setup_automerge-label_44DA8E40: Refreshing state... [id=cdktn-provider-random:automerge]
github_actions_secret.cdktn-provider-random_repo_secret-gh-token_E54F92D8: Refreshing state... [id=cdktn-provider-random:GH_TOKEN]
github_issue_label.cdktn-provider-random_repository-setup_auto-approve-label_959A1186: Refreshing state... [id=cdktn-provider-random:auto-approve]
github_repository_webhook.cdktn-provider-random_repository-setup_slack-webhook_B4F79AC0: Refreshing state... [id=591040295]
github_branch_protection.cdktn-provider-random_repository-setup_main-protection_B6FBF2B4: Refreshing state... [id=BPR_kwDOQ3ydlc4EQ-ES]
github_actions_secret.cdktn-provider-random_repo_secret-twine-password_DCAC6B64: Refreshing state... [id=cdktn-provider-random:TWINE_PASSWORD]
github_actions_secret.cdktn-provider-random_repo_secret-twine-username_10579F43: Refreshing state... [id=cdktn-provider-random:TWINE_USERNAME]
github_repository_dependabot_security_updates.cdktn-provider-random_dependabot-security_5CEA0EC0: Refreshing state... [id=cdktn-provider-random]
github_actions_secret.cdktn-provider-random_repo_secret-gh-app-id-alias-PROJEN_APP_ID_07D87EED: Refreshing state... [id=cdktn-provider-random:PROJEN_APP_ID]
github_actions_secret.cdktn-provider-random_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_40CDA2A2: Refreshing state... [id=cdktn-provider-random:PROJEN_GITHUB_TOKEN]
github_actions_secret.cdktn-provider-random_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_BD586CFE: Refreshing state... [id=cdktn-provider-random:GO_GITHUB_TOKEN]
github_issue_label.cdktn-provider-random_repository-setup_no-auto-close-label_99A97A36: Refreshing state... [id=cdktn-provider-random:no-auto-close]
github_branch_protection.cdktn-provider-time_repository-setup_main-protection_DAF3B634: Refreshing state... [id=BPR_kwDOQ3yfMs4EQ-EO]
github_actions_secret.cdktn-provider-time_repo_secret-gh-token_ABDA9098: Refreshing state... [id=cdktn-provider-time:GH_TOKEN]
github_actions_secret.cdktn-provider-time_repo_secret-npm-token_2397685A: Refreshing state... [id=cdktn-provider-time:NPM_TOKEN]
data.github_team.cdktn-team-cdk-terrain: Still reading... [00m30s elapsed]
github_issue_label.cdktn-provider-time_repository-setup_automerge-label_5532521E: Refreshing state... [id=cdktn-provider-time:automerge]
github_actions_secret.cdktn-provider-time_repo_secret-twine-password_26E97432: Refreshing state... [id=cdktn-provider-time:TWINE_PASSWORD]
github_issue_label.cdktn-provider-time_repository-setup_auto-approve-label_AD525EAF: Refreshing state... [id=cdktn-provider-time:auto-approve]
github_actions_secret.cdktn-provider-time_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_E4E5F3BA: Refreshing state... [id=cdktn-provider-time:GO_GITHUB_TOKEN]
github_actions_secret.cdktn-provider-time_repo_secret-gh-app-id_98275258: Refreshing state... [id=cdktn-provider-time:GH_APP_ID]
github_repository_dependabot_security_updates.cdktn-provider-time_dependabot-security_13D1B3EF: Refreshing state... [id=cdktn-provider-time]
github_issue_label.cdktn-provider-time_repository-setup_no-auto-close-label_F22DF709: Refreshing state... [id=cdktn-provider-time:no-auto-close]
github_actions_secret.cdktn-provider-time_repo_secret-gh-app-private-key_F74AA24C: Refreshing state... [id=cdktn-provider-time:GH_APP_PRIVATE_KEY]
github_actions_secret.cdktn-provider-time_repo_secret-alert-prs-slack-webhook-url_027D9334: Refreshing state... [id=cdktn-provider-time:ALERT_PRS_SLACK_WEBHOOK_URL]
github_actions_secret.cdktn-provider-time_repo_secret-gh-app-id-alias-PROJEN_APP_ID_43D02057: Refreshing state... [id=cdktn-provider-time:PROJEN_APP_ID]
github_actions_secret.cdktn-provider-time_repo_secret-gh-app-private-key-alias-PROJEN_APP_PRIVATE_KEY_5F1E9157: Refreshing state... [id=cdktn-provider-time:PROJEN_APP_PRIVATE_KEY]
github_actions_secret.cdktn-provider-time_repo_secret-twine-username_1D9B4B2F: Refreshing state... [id=cdktn-provider-time:TWINE_USERNAME]
github_actions_secret.cdktn-provider-time_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_5C583DD6: Refreshing state... [id=cdktn-provider-time:PROJEN_GITHUB_TOKEN]
github_repository_webhook.cdktn-provider-time_repository-setup_slack-webhook_B1EA3888: Refreshing state... [id=591040137]
github_issue_label.cdktn-provider-null_repository-setup_no-auto-close-label_AA35A13A: Refreshing state... [id=cdktn-provider-null:no-auto-close]
github_actions_secret.cdktn-provider-null_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_8F488331: Refreshing state... [id=cdktn-provider-null:GO_GITHUB_TOKEN]
github_actions_secret.cdktn-provider-null_repo_secret-gh-app-private-key-alias-PROJEN_APP_PRIVATE_KEY_6021F74C: Refreshing state... [id=cdktn-provider-null:PROJEN_APP_PRIVATE_KEY]
github_repository_dependabot_security_updates.cdktn-provider-null_dependabot-security_ACF3ADF8: Refreshing state... [id=cdktn-provider-null]
github_actions_secret.cdktn-provider-null_repo_secret-gh-app-private-key_B3488266: Refreshing state... [id=cdktn-provider-null:GH_APP_PRIVATE_KEY]
github_actions_secret.cdktn-provider-null_repo_secret-npm-token_0C53C47C: Refreshing state... [id=cdktn-provider-null:NPM_TOKEN]
github_branch_protection.cdktn-provider-null_repository-setup_main-protection_86EA9BE3: Refreshing state... [id=BPR_kwDOQ3yb0M4EQ-Dg]
github_issue_label.cdktn-provider-null_repository-setup_automerge-label_4C022417: Refreshing state... [id=cdktn-provider-null:automerge]
github_actions_secret.cdktn-provider-null_repo_secret-twine-password_7DBC89AD: Refreshing state... [id=cdktn-provider-null:TWINE_PASSWORD]
github_actions_secret.cdktn-provider-null_repo_secret-alert-prs-slack-webhook-url_81D0947F: Refreshing state... [id=cdktn-provider-null:ALERT_PRS_SLACK_WEBHOOK_URL]
github_actions_secret.cdktn-provider-null_repo_secret-gh-token_20308718: Refreshing state... [id=cdktn-provider-null:GH_TOKEN]
github_actions_secret.cdktn-provider-null_repo_secret-gh-app-id-alias-PROJEN_APP_ID_F7058CE7: Refreshing state... [id=cdktn-provider-null:PROJEN_APP_ID]
github_actions_secret.cdktn-provider-null_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_DFFA6182: Refreshing state... [id=cdktn-provider-null:PROJEN_GITHUB_TOKEN]
github_actions_secret.cdktn-provider-null_repo_secret-gh-app-id_C7954F88: Refreshing state... [id=cdktn-provider-null:GH_APP_ID]
github_actions_secret.cdktn-provider-null_repo_secret-twine-username_A5BB8BE4: Refreshing state... [id=cdktn-provider-null:TWINE_USERNAME]
github_issue_label.cdktn-provider-null_repository-setup_auto-approve-label_4AAD6EF3: Refreshing state... [id=cdktn-provider-null:auto-approve]
github_repository_webhook.cdktn-provider-null_repository-setup_slack-webhook_AFBEBD1B: Refreshing state... [id=591039983]
github_issue_label.cdktn-provider-aws-go_repository-setup_no-auto-close-label_83543C8B: Refreshing state... [id=cdktn-provider-aws-go:no-auto-close]
github_issue_label.cdktn-provider-aws-go_repository-setup_automerge-label_52B276F5: Refreshing state... [id=cdktn-provider-aws-go:automerge]
github_repository_webhook.cdktn-provider-aws-go_repository-setup_slack-webhook_DB004E63: Refreshing state... [id=591864036]
github_issue_label.cdktn-provider-aws-go_repository-setup_auto-approve-label_104A4F6B: Refreshing state... [id=cdktn-provider-aws-go:auto-approve]
github_issue_label.cdktn-provider-kubernetes-go_repository-setup_automerge-label_A2224DB3: Refreshing state... [id=cdktn-provider-kubernetes-go:automerge]
github_issue_label.cdktn-provider-kubernetes-go_repository-setup_no-auto-close-label_D7858E8D: Refreshing state... [id=cdktn-provider-kubernetes-go:no-auto-close]
github_repository_webhook.cdktn-provider-kubernetes-go_repository-setup_slack-webhook_44A33CFD: Refreshing state... [id=591695056]
github_issue_label.cdktn-provider-kubernetes-go_repository-setup_auto-approve-label_86817720: Refreshing state... [id=cdktn-provider-kubernetes-go:auto-approve]
github_repository_webhook.cdktn-provider-tls_repository-setup_slack-webhook_D01381AE: Refreshing state... [id=591040087]
github_repository_dependabot_security_updates.cdktn-provider-tls_dependabot-security_30DC7F1D: Refreshing state... [id=cdktn-provider-tls]
github_actions_secret.cdktn-provider-tls_repo_secret-gh-app-private-key-alias-PROJEN_APP_PRIVATE_KEY_9186592F: Refreshing state... [id=cdktn-provider-tls:PROJEN_APP_PRIVATE_KEY]
github_actions_secret.cdktn-provider-tls_repo_secret-gh-app-id-alias-PROJEN_APP_ID_125C7CEF: Refreshing state... [id=cdktn-provider-tls:PROJEN_APP_ID]
github_issue_label.cdktn-provider-tls_repository-setup_automerge-label_35046484: Refreshing state... [id=cdktn-provider-tls:automerge]
github_actions_secret.cdktn-provider-tls_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_F5F8F642: Refreshing state... [id=cdktn-provider-tls:PROJEN_GITHUB_TOKEN]
github_actions_secret.cdktn-provider-tls_repo_secret-gh-token_5CC5F820: Refreshing state... [id=cdktn-provider-tls:GH_TOKEN]
github_actions_secret.cdktn-provider-tls_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_4985AB9F: Refreshing state... [id=cdktn-provider-tls:GO_GITHUB_TOKEN]
github_actions_secret.cdktn-provider-tls_repo_secret-gh-app-id_B41C5F31: Refreshing state... [id=cdktn-provider-tls:GH_APP_ID]
github_actions_secret.cdktn-provider-tls_repo_secret-npm-token_8CF3F573: Refreshing state... [id=cdktn-provider-tls:NPM_TOKEN]
github_actions_secret.cdktn-provider-tls_repo_secret-twine-username_AE608064: Refreshing state... [id=cdktn-provider-tls:TWINE_USERNAME]
github_issue_label.cdktn-provider-tls_repository-setup_auto-approve-label_19B887F0: Refreshing state... [id=cdktn-provider-tls:auto-approve]
github_issue_label.cdktn-provider-tls_repository-setup_no-auto-close-label_AD814C1F: Refreshing state... [id=cdktn-provider-tls:no-auto-close]
github_actions_secret.cdktn-provider-tls_repo_secret-alert-prs-slack-webhook-url_E9358678: Refreshing state... [id=cdktn-provider-tls:ALERT_PRS_SLACK_WEBHOOK_URL]
data.github_team.cdktn-team-cdk-terrain: Still reading... [00m40s elapsed]
github_branch_protection.cdktn-provider-tls_repository-setup_main-protection_C7C2FF91: Refreshing state... [id=BPR_kwDOQ3yguM4EQ-Dr]
github_actions_secret.cdktn-provider-tls_repo_secret-twine-password_A45CD237: Refreshing state... [id=cdktn-provider-tls:TWINE_PASSWORD]
github_actions_secret.cdktn-provider-tls_repo_secret-gh-app-private-key_8AFF1008: Refreshing state... [id=cdktn-provider-tls:GH_APP_PRIVATE_KEY]
github_actions_secret.cdktn-provider-cloudinit_repo_secret-twine-username_B3F38BF0: Refreshing state... [id=cdktn-provider-cloudinit:TWINE_USERNAME]
github_actions_secret.cdktn-provider-cloudinit_repo_secret-gh-app-id-alias-PROJEN_APP_ID_2B2FE55F: Refreshing state... [id=cdktn-provider-cloudinit:PROJEN_APP_ID]
github_branch_protection.cdktn-provider-cloudinit_repository-setup_main-protection_FDA34103: Refreshing state... [id=BPR_kwDOQ3xxyM4EQ9_u]
github_actions_secret.cdktn-provider-cloudinit_repo_secret-gh-app-private-key-alias-PROJEN_APP_PRIVATE_KEY_79D9AAB4: Refreshing state... [id=cdktn-provider-cloudinit:PROJEN_APP_PRIVATE_KEY]
github_issue_label.cdktn-provider-cloudinit_repository-setup_automerge-label_5DAFF08C: Refreshing state... [id=cdktn-provider-cloudinit:automerge]
github_actions_secret.cdktn-provider-cloudinit_repo_secret-twine-password_95C843B1: Refreshing state... [id=cdktn-provider-cloudinit:TWINE_PASSWORD]
github_repository_dependabot_security_updates.cdktn-provider-cloudinit_dependabot-security_CB91C1EC: Refreshing state... [id=cdktn-provider-cloudinit]
github_actions_secret.cdktn-provider-cloudinit_repo_secret-gh-app-private-key_C9777824: Refreshing state... [id=cdktn-provider-cloudinit:GH_APP_PRIVATE_KEY]
github_repository_webhook.cdktn-provider-cloudinit_repository-setup_slack-webhook_3B504895: Refreshing state... [id=591037527]
github_actions_secret.cdktn-provider-cloudinit_repo_secret-gh-token_6C4D33CF: Refreshing state... [id=cdktn-provider-cloudinit:GH_TOKEN]
github_actions_secret.cdktn-provider-cloudinit_repo_secret-gh-app-id_FC609807: Refreshing state... [id=cdktn-provider-cloudinit:GH_APP_ID]
github_actions_secret.cdktn-provider-cloudinit_repo_secret-npm-token_652B547F: Refreshing state... [id=cdktn-provider-cloudinit:NPM_TOKEN]
github_issue_label.cdktn-provider-cloudinit_repository-setup_no-auto-close-label_84D5C117: Refreshing state... [id=cdktn-provider-cloudinit:no-auto-close]
github_actions_secret.cdktn-provider-cloudinit_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_6E439A90: Refreshing state... [id=cdktn-provider-cloudinit:PROJEN_GITHUB_TOKEN]
github_actions_secret.cdktn-provider-cloudinit_repo_secret-alert-prs-slack-webhook-url_2D5F82FA: Refreshing state... [id=cdktn-provider-cloudinit:ALERT_PRS_SLACK_WEBHOOK_URL]
github_issue_label.cdktn-provider-cloudinit_repository-setup_auto-approve-label_4DA89DC4: Refreshing state... [id=cdktn-provider-cloudinit:auto-approve]
github_actions_secret.cdktn-provider-cloudinit_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_B09BA867: Refreshing state... [id=cdktn-provider-cloudinit:GO_GITHUB_TOKEN]
github_issue_label.cdktn-provider-external-go_repository-setup_no-auto-close-label_D8F52EF9: Refreshing state... [id=cdktn-provider-external-go:no-auto-close]
github_issue_label.cdktn-provider-external-go_repository-setup_auto-approve-label_7D178F61: Refreshing state... [id=cdktn-provider-external-go:auto-approve]
github_repository_webhook.cdktn-provider-external-go_repository-setup_slack-webhook_CCE55CFA: Refreshing state... [id=591037878]
github_issue_label.cdktn-provider-external-go_repository-setup_automerge-label_CB4166DE: Refreshing state... [id=cdktn-provider-external-go:automerge]
github_issue_label.cdktn-provider-cloudinit-go_repository-setup_no-auto-close-label_896FBAD0: Refreshing state... [id=cdktn-provider-cloudinit-go:no-auto-close]
github_repository_webhook.cdktn-provider-cloudinit-go_repository-setup_slack-webhook_97729D2C: Refreshing state... [id=591037890]
github_issue_label.cdktn-provider-cloudinit-go_repository-setup_auto-approve-label_C51A0A34: Refreshing state... [id=cdktn-provider-cloudinit-go:auto-approve]
github_issue_label.cdktn-provider-cloudinit-go_repository-setup_automerge-label_BCFA026C: Refreshing state... [id=cdktn-provider-cloudinit-go:automerge]
github_issue_label.cdktn-provider-tls-go_repository-setup_no-auto-close-label_4A291563: Refreshing state... [id=cdktn-provider-tls-go:no-auto-close]
github_issue_label.cdktn-provider-tls-go_repository-setup_auto-approve-label_FAFD17B2: Refreshing state... [id=cdktn-provider-tls-go:auto-approve]
github_repository_webhook.cdktn-provider-tls-go_repository-setup_slack-webhook_E0370E7E: Refreshing state... [id=591040440]
github_issue_label.cdktn-provider-tls-go_repository-setup_automerge-label_FB4AD0A6: Refreshing state... [id=cdktn-provider-tls-go:automerge]
github_repository_webhook.cdktn-provider-random-go_repository-setup_slack-webhook_DCE686E3: Refreshing state... [id=591040391]
github_issue_label.cdktn-provider-random-go_repository-setup_automerge-label_67544DD0: Refreshing state... [id=cdktn-provider-random-go:automerge]
github_issue_label.cdktn-provider-random-go_repository-setup_auto-approve-label_A93649E2: Refreshing state... [id=cdktn-provider-random-go:auto-approve]
github_issue_label.cdktn-provider-random-go_repository-setup_no-auto-close-label_7D51A4B6: Refreshing state... [id=cdktn-provider-random-go:no-auto-close]
github_repository_webhook.cdktn-provider-project_repository-setup_slack-webhook_643E1C2A: Refreshing state... [id=590697331]
github_issue_label.cdktn-provider-project_repository-setup_no-auto-close-label_F083F499: Refreshing state... [id=cdktn-provider-project:no-auto-close]
github_issue_label.cdktn-provider-project_repository-setup_automerge-label_D42B3734: Refreshing state... [id=cdktn-provider-project:automerge]
github_actions_secret.cdktn-provider-project_repo_secret-npm-token_EF9ECEF8: Refreshing state... [id=cdktn-provider-project:NPM_TOKEN]
github_actions_secret.cdktn-provider-project_repo_secret-gh-app-id_1BD851F6: Refreshing state... [id=cdktn-provider-project:GH_APP_ID]
github_actions_secret.cdktn-provider-project_repo_secret-gh-app-id-alias-PROJEN_APP_ID_767CA43E: Refreshing state... [id=cdktn-provider-project:PROJEN_APP_ID]
github_repository_dependabot_security_updates.cdktn-provider-project_dependabot-security_4D4BB742: Refreshing state... [id=cdktn-provider-project]
github_branch_protection.cdktn-provider-project_repository-setup_main-protection_EF7C5990: Refreshing state... [id=BPR_kwDOQ2rcD84EQwfc]
github_actions_secret.cdktn-provider-project_repo_secret-gh-app-private-key-alias-PROJEN_APP_PRIVATE_KEY_70EA4404: Refreshing state... [id=cdktn-provider-project:PROJEN_APP_PRIVATE_KEY]
github_actions_secret.cdktn-provider-project_repo_secret-gh-app-private-key_EDA9175B: Refreshing state... [id=cdktn-provider-project:GH_APP_PRIVATE_KEY]
github_issue_label.cdktn-provider-project_repository-setup_auto-approve-label_50DDC348: Refreshing state... [id=cdktn-provider-project:auto-approve]
github_actions_secret.cdktn-repository-manager_repo_secret-gh-app-id_204D17E4: Refreshing state... [id=cdktn-repository-manager:GH_APP_ID]
github_repository_dependabot_security_updates.cdktn-repository-manager_dependabot-security_9AE0C710: Refreshing state... [id=cdktn-repository-manager]
github_repository_webhook.cdktn-repository-manager_repository-setup_slack-webhook_DB6A1F1E: Refreshing state... [id=590727570]
github_actions_secret.cdktn-repository-manager_repo_secret-gh-app-private-key-alias-PROJEN_APP_PRIVATE_KEY_CAD15E98: Refreshing state... [id=cdktn-repository-manager:PROJEN_APP_PRIVATE_KEY]
github_actions_secret.cdktn-repository-manager_repo_secret-alert-prs-slack-webhook-url_28BB624E: Refreshing state... [id=cdktn-repository-manager:ALERT_PRS_SLACK_WEBHOOK_URL]
github_actions_secret.cdktn-repository-manager_repo_secret-slack-webhook_191CEBCB: Refreshing state... [id=cdktn-repository-manager:SLACK_WEBHOOK]
data.github_team.cdktn-team-cdk-terrain: Still reading... [00m50s elapsed]
github_actions_secret.cdktn-repository-manager_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_CEEDD8C9: Refreshing state... [id=cdktn-repository-manager:PROJEN_GITHUB_TOKEN]
github_issue_label.cdktn-repository-manager_repository-setup_auto-approve-label_DAD350EF: Refreshing state... [id=cdktn-repository-manager:auto-approve]
github_actions_secret.cdktn-repository-manager_repo_secret-npm-token_5B4F31F4: Refreshing state... [id=cdktn-repository-manager:NPM_TOKEN]
github_actions_secret.cdktn-repository-manager_repo_secret-gh-comment-token_996A9C24: Refreshing state... [id=cdktn-repository-manager:GH_COMMENT_TOKEN]
github_actions_secret.cdktn-repository-manager_repo_secret-gh-token_29FAB6B7: Refreshing state... [id=cdktn-repository-manager:GH_TOKEN]
github_issue_label.cdktn-repository-manager_repository-setup_no-auto-close-label_83B7F678: Refreshing state... [id=cdktn-repository-manager:no-auto-close]
github_actions_secret.cdktn-repository-manager_repo_secret-twine-password_0F45062D: Refreshing state... [id=cdktn-repository-manager:TWINE_PASSWORD]
github_actions_secret.cdktn-repository-manager_repo_secret-gh-app-private-key_DF203D06: Refreshing state... [id=cdktn-repository-manager:GH_APP_PRIVATE_KEY]
github_actions_secret.cdktn-repository-manager_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_2E906457: Refreshing state... [id=cdktn-repository-manager:GO_GITHUB_TOKEN]
github_issue_label.cdktn-repository-manager_repository-setup_automerge-label_EE6290A1: Refreshing state... [id=cdktn-repository-manager:automerge]
github_actions_secret.cdktn-repository-manager_repo_secret-gh-app-id-alias-PROJEN_APP_ID_17E81419: Refreshing state... [id=cdktn-repository-manager:PROJEN_APP_ID]
github_actions_secret.cdktn-repository-manager_repo_secret-twine-username_B667DCDA: Refreshing state... [id=cdktn-repository-manager:TWINE_USERNAME]
github_actions_secret.cdktn-provider-docker_repo_secret-alert-prs-slack-webhook-url_7F1B7484: Refreshing state... [id=cdktn-provider-docker:ALERT_PRS_SLACK_WEBHOOK_URL]
github_actions_secret.cdktn-provider-docker_repo_secret-npm-token_DD40930E: Refreshing state... [id=cdktn-provider-docker:NPM_TOKEN]
github_actions_secret.cdktn-provider-docker_repo_secret-gh-token_E88B7415: Refreshing state... [id=cdktn-provider-docker:GH_TOKEN]
github_issue_label.cdktn-provider-docker_repository-setup_no-auto-close-label_C8BDAEF0: Refreshing state... [id=cdktn-provider-docker:no-auto-close]
github_actions_secret.cdktn-provider-docker_repo_secret-twine-username_BE540D6B: Refreshing state... [id=cdktn-provider-docker:TWINE_USERNAME]
github_issue_label.cdktn-provider-docker_repository-setup_auto-approve-label_0E96F098: Refreshing state... [id=cdktn-provider-docker:auto-approve]
github_actions_secret.cdktn-provider-docker_repo_secret-gh-app-id-alias-PROJEN_APP_ID_6C6CBFC6: Refreshing state... [id=cdktn-provider-docker:PROJEN_APP_ID]
github_actions_secret.cdktn-provider-docker_repo_secret-gh-app-id_D56D9346: Refreshing state... [id=cdktn-provider-docker:GH_APP_ID]
github_branch_protection.cdktn-provider-docker_repository-setup_main-protection_AB531BE6: Refreshing state... [id=BPR_kwDOQ3xz_s4EQ-AD]
github_actions_secret.cdktn-provider-docker_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_EDC8B29C: Refreshing state... [id=cdktn-provider-docker:PROJEN_GITHUB_TOKEN]
github_repository_dependabot_security_updates.cdktn-provider-docker_dependabot-security_AF77608B: Refreshing state... [id=cdktn-provider-docker]
github_actions_secret.cdktn-provider-docker_repo_secret-twine-password_22A42B30: Refreshing state... [id=cdktn-provider-docker:TWINE_PASSWORD]
github_actions_secret.cdktn-provider-docker_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_FD3ABA72: Refreshing state... [id=cdktn-provider-docker:GO_GITHUB_TOKEN]
github_repository_webhook.cdktn-provider-docker_repository-setup_slack-webhook_CBDE01DF: Refreshing state... [id=591037806]
github_issue_label.cdktn-provider-docker_repository-setup_automerge-label_E61C4364: Refreshing state... [id=cdktn-provider-docker:automerge]
github_actions_secret.cdktn-provider-docker_repo_secret-gh-app-private-key-alias-PROJEN_APP_PRIVATE_KEY_A8AAD092: Refreshing state... [id=cdktn-provider-docker:PROJEN_APP_PRIVATE_KEY]
github_actions_secret.cdktn-provider-docker_repo_secret-gh-app-private-key_1A5FE556: Refreshing state... [id=cdktn-provider-docker:GH_APP_PRIVATE_KEY]
github_issue_label.cdktn-provider-kubernetes_repository-setup_no-auto-close-label_247C0574: Refreshing state... [id=cdktn-provider-kubernetes:no-auto-close]
github_actions_secret.cdktn-provider-kubernetes_repo_secret-twine-password_5B309626: Refreshing state... [id=cdktn-provider-kubernetes:TWINE_PASSWORD]
github_actions_secret.cdktn-provider-kubernetes_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_5384DEBE: Refreshing state... [id=cdktn-provider-kubernetes:PROJEN_GITHUB_TOKEN]
github_actions_secret.cdktn-provider-kubernetes_repo_secret-npm-token_ED15FB55: Refreshing state... [id=cdktn-provider-kubernetes:NPM_TOKEN]
github_actions_secret.cdktn-provider-kubernetes_repo_secret-twine-username_B2AFC50B: Refreshing state... [id=cdktn-provider-kubernetes:TWINE_USERNAME]
github_actions_secret.cdktn-provider-kubernetes_repo_secret-gh-token_C92D2ADC: Refreshing state... [id=cdktn-provider-kubernetes:GH_TOKEN]
github_actions_secret.cdktn-provider-kubernetes_repo_secret-gh-app-private-key-alias-PROJEN_APP_PRIVATE_KEY_4B6A1180: Refreshing state... [id=cdktn-provider-kubernetes:PROJEN_APP_PRIVATE_KEY]
github_actions_secret.cdktn-provider-kubernetes_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_A4AE1085: Refreshing state... [id=cdktn-provider-kubernetes:GO_GITHUB_TOKEN]
github_branch_protection.cdktn-provider-kubernetes_repository-setup_main-protection_DA0387AC: Refreshing state... [id=BPR_kwDOQ6LMcc4ERiiL]
github_actions_secret.cdktn-provider-kubernetes_repo_secret-gh-app-id_8F887D67: Refreshing state... [id=cdktn-provider-kubernetes:GH_APP_ID]
github_actions_secret.cdktn-provider-kubernetes_repo_secret-gh-app-id-alias-PROJEN_APP_ID_2AD8C00B: Refreshing state... [id=cdktn-provider-kubernetes:PROJEN_APP_ID]
github_actions_secret.cdktn-provider-kubernetes_repo_secret-alert-prs-slack-webhook-url_6D7161A3: Refreshing state... [id=cdktn-provider-kubernetes:ALERT_PRS_SLACK_WEBHOOK_URL]
github_actions_secret.cdktn-provider-kubernetes_repo_secret-gh-app-private-key_2927BDC8: Refreshing state... [id=cdktn-provider-kubernetes:GH_APP_PRIVATE_KEY]
github_issue_label.cdktn-provider-kubernetes_repository-setup_automerge-label_5D0F5FD0: Refreshing state... [id=cdktn-provider-kubernetes:automerge]
github_issue_label.cdktn-provider-kubernetes_repository-setup_auto-approve-label_C26E83FC: Refreshing state... [id=cdktn-provider-kubernetes:auto-approve]
github_repository_dependabot_security_updates.cdktn-provider-kubernetes_dependabot-security_518A0D22: Refreshing state... [id=cdktn-provider-kubernetes]
github_repository_webhook.cdktn-provider-kubernetes_repository-setup_slack-webhook_3EC59D24: Refreshing state... [id=591693541]
github_repository_webhook.cdktn-provider-local-go_repository-setup_slack-webhook_BFECD5FD: Refreshing state... [id=591040467]
github_issue_label.cdktn-provider-local-go_repository-setup_auto-approve-label_73D480D5: Refreshing state... [id=cdktn-provider-local-go:auto-approve]
data.github_team.cdktn-team-cdk-terrain: Still reading... [01m00s elapsed]
github_issue_label.cdktn-provider-local-go_repository-setup_automerge-label_2D32C3D4: Refreshing state... [id=cdktn-provider-local-go:automerge]
github_issue_label.cdktn-provider-local-go_repository-setup_no-auto-close-label_1314D98B: Refreshing state... [id=cdktn-provider-local-go:no-auto-close]
github_issue_label.cdktn-provider-aws_repository-setup_automerge-label_4F4B7FAB: Refreshing state... [id=cdktn-provider-aws:automerge]
github_issue_label.cdktn-provider-aws_repository-setup_auto-approve-label_C70E2818: Refreshing state... [id=cdktn-provider-aws:auto-approve]
github_actions_secret.cdktn-provider-aws_repo_secret-npm-token_8361EB4A: Refreshing state... [id=cdktn-provider-aws:NPM_TOKEN]
github_actions_secret.cdktn-provider-aws_repo_secret-gh-app-id-alias-PROJEN_APP_ID_248425AD: Refreshing state... [id=cdktn-provider-aws:PROJEN_APP_ID]
github_repository_dependabot_security_updates.cdktn-provider-aws_dependabot-security_835B1C19: Refreshing state... [id=cdktn-provider-aws]
github_actions_secret.cdktn-provider-aws_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_BE1C067A: Refreshing state... [id=cdktn-provider-aws:GO_GITHUB_TOKEN]
github_actions_secret.cdktn-provider-aws_repo_secret-twine-password_8580036B: Refreshing state... [id=cdktn-provider-aws:TWINE_PASSWORD]
github_issue_label.cdktn-provider-aws_repository-setup_no-auto-close-label_204DD130: Refreshing state... [id=cdktn-provider-aws:no-auto-close]
github_branch_protection.cdktn-provider-aws_repository-setup_main-protection_8908C6CC: Refreshing state... [id=BPR_kwDOQ6MMBM4ERrqz]
github_repository_webhook.cdktn-provider-aws_repository-setup_slack-webhook_345B3D64: Refreshing state... [id=591863752]
github_actions_secret.cdktn-provider-aws_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_EF4EA2F2: Refreshing state... [id=cdktn-provider-aws:PROJEN_GITHUB_TOKEN]
github_actions_secret.cdktn-provider-aws_repo_secret-gh-app-private-key_F82B911E: Refreshing state... [id=cdktn-provider-aws:GH_APP_PRIVATE_KEY]
github_actions_secret.cdktn-provider-aws_repo_secret-gh-token_4B61A244: Refreshing state... [id=cdktn-provider-aws:GH_TOKEN]
github_actions_secret.cdktn-provider-aws_repo_secret-twine-username_917EFB10: Refreshing state... [id=cdktn-provider-aws:TWINE_USERNAME]
github_actions_secret.cdktn-provider-aws_repo_secret-gh-app-private-key-alias-PROJEN_APP_PRIVATE_KEY_D6EBC20D: Refreshing state... [id=cdktn-provider-aws:PROJEN_APP_PRIVATE_KEY]
github_actions_secret.cdktn-provider-aws_repo_secret-alert-prs-slack-webhook-url_1F4B3133: Refreshing state... [id=cdktn-provider-aws:ALERT_PRS_SLACK_WEBHOOK_URL]
github_actions_secret.cdktn-provider-aws_repo_secret-gh-app-id_5C1C3B0A: Refreshing state... [id=cdktn-provider-aws:GH_APP_ID]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # github_actions_secret.cdktn-provider-azurerm_repo_secret-alert-prs-slack-webhook-url_3DEE0CCC will be created
  + resource "github_actions_secret" "cdktn-provider-azurerm_repo_secret-alert-prs-slack-webhook-url_3DEE0CCC" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktn-provider-azurerm"
      + secret_name     = "ALERT_PRS_SLACK_WEBHOOK_URL"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktn-provider-azurerm_repo_secret-gh-app-id-alias-PROJEN_APP_ID_03A7C388 will be created
  + resource "github_actions_secret" "cdktn-provider-azurerm_repo_secret-gh-app-id-alias-PROJEN_APP_ID_03A7C388" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktn-provider-azurerm"
      + secret_name     = "PROJEN_APP_ID"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktn-provider-azurerm_repo_secret-gh-app-id_F3F7DE54 will be created
  + resource "github_actions_secret" "cdktn-provider-azurerm_repo_secret-gh-app-id_F3F7DE54" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktn-provider-azurerm"
      + secret_name     = "GH_APP_ID"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktn-provider-azurerm_repo_secret-gh-app-private-key-alias-PROJEN_APP_PRIVATE_KEY_B467195A will be created
  + resource "github_actions_secret" "cdktn-provider-azurerm_repo_secret-gh-app-private-key-alias-PROJEN_APP_PRIVATE_KEY_B467195A" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktn-provider-azurerm"
      + secret_name     = "PROJEN_APP_PRIVATE_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktn-provider-azurerm_repo_secret-gh-app-private-key_728C9E43 will be created
  + resource "github_actions_secret" "cdktn-provider-azurerm_repo_secret-gh-app-private-key_728C9E43" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktn-provider-azurerm"
      + secret_name     = "GH_APP_PRIVATE_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktn-provider-azurerm_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_23459056 will be created
  + resource "github_actions_secret" "cdktn-provider-azurerm_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_23459056" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktn-provider-azurerm"
      + secret_name     = "GO_GITHUB_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktn-provider-azurerm_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_34157FC4 will be created
  + resource "github_actions_secret" "cdktn-provider-azurerm_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_34157FC4" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktn-provider-azurerm"
      + secret_name     = "PROJEN_GITHUB_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktn-provider-azurerm_repo_secret-gh-token_990262B8 will be created
  + resource "github_actions_secret" "cdktn-provider-azurerm_repo_secret-gh-token_990262B8" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktn-provider-azurerm"
      + secret_name     = "GH_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktn-provider-azurerm_repo_secret-npm-token_CBEF1300 will be created
  + resource "github_actions_secret" "cdktn-provider-azurerm_repo_secret-npm-token_CBEF1300" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktn-provider-azurerm"
      + secret_name     = "NPM_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktn-provider-azurerm_repo_secret-twine-password_F9423D0A will be created
  + resource "github_actions_secret" "cdktn-provider-azurerm_repo_secret-twine-password_F9423D0A" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktn-provider-azurerm"
      + secret_name     = "TWINE_PASSWORD"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktn-provider-azurerm_repo_secret-twine-username_087C8662 will be created
  + resource "github_actions_secret" "cdktn-provider-azurerm_repo_secret-twine-username_087C8662" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktn-provider-azurerm"
      + secret_name     = "TWINE_USERNAME"
      + updated_at      = (known after apply)
    }

  # github_branch_protection.cdktn-provider-azurerm_repository-setup_main-protection_56EA72C4 will be created
  + resource "github_branch_protection" "cdktn-provider-azurerm_repository-setup_main-protection_56EA72C4" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "main"
      + repository_id                   = "cdktn-provider-azurerm"
      + require_conversation_resolution = true
      + require_signed_commits          = false
      + required_linear_history         = true

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = false
          + require_code_owner_reviews      = false
          + require_last_push_approval      = false
          + required_approving_review_count = 1
        }

      + required_status_checks {
          + contexts = [
              + "Validate PR title",
              + "build",
              + "package-go",
              + "package-js",
              + "package-python",
            ]
          + strict   = false
        }
    }

  # github_branch_protection.cdktn-provider-project_repository-setup_main-protection_EF7C5990 will be created
  + resource "github_branch_protection" "cdktn-provider-project_repository-setup_main-protection_EF7C5990" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "main"
      + repository_id                   = "cdktn-provider-project"
      + require_conversation_resolution = true
      + require_signed_commits          = false
      + required_linear_history         = true

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = false
          + require_code_owner_reviews      = false
          + require_last_push_approval      = false
          + required_approving_review_count = 1
        }

      + required_status_checks {
          + contexts = [
              + "build",
              + "package-js",
            ]
          + strict   = false
        }
    }

  # github_issue_label.cdktn-provider-azurerm-go_repository-setup_auto-approve-label_7F9E783C will be created
  + resource "github_issue_label" "cdktn-provider-azurerm-go_repository-setup_auto-approve-label_7F9E783C" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktn-provider-azurerm-go"
      + url        = (known after apply)
    }

  # github_issue_label.cdktn-provider-azurerm-go_repository-setup_automerge-label_BD7EA5B4 will be created
  + resource "github_issue_label" "cdktn-provider-azurerm-go_repository-setup_automerge-label_BD7EA5B4" {
      + color      = "5DC8DB"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "automerge"
      + repository = "cdktn-provider-azurerm-go"
      + url        = (known after apply)
    }

  # github_issue_label.cdktn-provider-azurerm-go_repository-setup_no-auto-close-label_16A58BEB will be created
  + resource "github_issue_label" "cdktn-provider-azurerm-go_repository-setup_no-auto-close-label_16A58BEB" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktn-provider-azurerm-go"
      + url        = (known after apply)
    }

  # github_issue_label.cdktn-provider-azurerm_repository-setup_auto-approve-label_7C4C571A will be created
  + resource "github_issue_label" "cdktn-provider-azurerm_repository-setup_auto-approve-label_7C4C571A" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktn-provider-azurerm"
      + url        = (known after apply)
    }

  # github_issue_label.cdktn-provider-azurerm_repository-setup_automerge-label_954A59CE will be created
  + resource "github_issue_label" "cdktn-provider-azurerm_repository-setup_automerge-label_954A59CE" {
      + color      = "5DC8DB"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "automerge"
      + repository = "cdktn-provider-azurerm"
      + url        = (known after apply)
    }

  # github_issue_label.cdktn-provider-azurerm_repository-setup_no-auto-close-label_28EF6DBE will be created
  + resource "github_issue_label" "cdktn-provider-azurerm_repository-setup_no-auto-close-label_28EF6DBE" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktn-provider-azurerm"
      + url        = (known after apply)
    }

  # github_repository.cdktn-provider-azurerm-go_repo_C5B858ED will be created
  + resource "github_repository" "cdktn-provider-azurerm-go_repo_C5B858ED" {
      + allow_auto_merge            = true
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + allow_update_branch         = true
      + archive_on_destroy          = true
      + archived                    = false
      + auto_init                   = true
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + description                 = "CDK for Terraform Go provider bindings for azurerm."
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = false
      + has_projects                = false
      + has_wiki                    = false
      + homepage_url                = "https://cdk.tf"
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "cdktn-provider-azurerm-go"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "PR_BODY"
      + squash_merge_commit_title   = "PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = [
          + "azurerm",
          + "cdk",
          + "cdktf",
          + "pre-built-provider",
          + "provider",
          + "terraform",
          + "terraform-cdk",
        ]
      + visibility                  = "public"
      + vulnerability_alerts        = false
      + web_commit_signoff_required = false

      + security_and_analysis (known after apply)
    }

  # github_repository.cdktn-provider-azurerm_repo_25F8C0DE will be created
  + resource "github_repository" "cdktn-provider-azurerm_repo_25F8C0DE" {
      + allow_auto_merge            = true
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + allow_update_branch         = true
      + archive_on_destroy          = true
      + archived                    = false
      + auto_init                   = true
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + description                 = "Prebuilt Terraform CDK (cdktf) provider for azurerm."
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = true
      + has_projects                = false
      + has_wiki                    = false
      + homepage_url                = "https://cdk.tf"
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "cdktn-provider-azurerm"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "PR_BODY"
      + squash_merge_commit_title   = "PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = [
          + "azurerm",
          + "cdk",
          + "cdktf",
          + "pre-built-provider",
          + "provider",
          + "terraform",
          + "terraform-cdk",
        ]
      + visibility                  = "public"
      + vulnerability_alerts        = true
      + web_commit_signoff_required = false

      + security_and_analysis (known after apply)
    }

  # github_repository_dependabot_security_updates.cdktn-provider-azurerm_dependabot-security_50DE6661 will be created
  + resource "github_repository_dependabot_security_updates" "cdktn-provider-azurerm_dependabot-security_50DE6661" {
      + enabled    = true
      + id         = (known after apply)
      + repository = "cdktn-provider-azurerm"
    }

  # github_repository_webhook.cdktn-provider-azurerm-go_repository-setup_slack-webhook_20010394 will be created
  + resource "github_repository_webhook" "cdktn-provider-azurerm-go_repository-setup_slack-webhook_20010394" {
      + active     = true
      + etag       = (known after apply)
      + events     = [
          + "issues",
        ]
      + id         = (known after apply)
      + repository = "cdktn-provider-azurerm-go"
      + url        = (known after apply)

      + configuration {
          + content_type = "json"
          + url          = (sensitive value)
        }
    }

  # github_repository_webhook.cdktn-provider-azurerm_repository-setup_slack-webhook_84ED2A61 will be created
  + resource "github_repository_webhook" "cdktn-provider-azurerm_repository-setup_slack-webhook_84ED2A61" {
      + active     = true
      + etag       = (known after apply)
      + events     = [
          + "issues",
        ]
      + id         = (known after apply)
      + repository = "cdktn-provider-azurerm"
      + url        = (known after apply)

      + configuration {
          + content_type = "json"
          + url          = (sensitive value)
        }
    }

Plan: 24 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + providerRepos   = [
      + "github_repository.cdktn-provider-archive_repo_7B884DD9.ssh_clone_url",
      + "github_repository.cdktn-provider-aws_repo_45EAAAF4.ssh_clone_url",
      + "github_repository.cdktn-provider-azurerm_repo_25F8C0DE.ssh_clone_url",
      + "github_repository.cdktn-provider-cloudinit_repo_8DDE9C9A.ssh_clone_url",
      + "github_repository.cdktn-provider-docker_repo_B5F1E60F.ssh_clone_url",
      + "github_repository.cdktn-provider-external_repo_1F85962F.ssh_clone_url",
      + "github_repository.cdktn-provider-github_repo_4B89F268.ssh_clone_url",
      + "github_repository.cdktn-provider-kubernetes_repo_A94DB71E.ssh_clone_url",
      + "github_repository.cdktn-provider-local_repo_5CE00778.ssh_clone_url",
      + "github_repository.cdktn-provider-null_repo_41CFF515.ssh_clone_url",
      + "github_repository.cdktn-provider-random_repo_D20F5E27.ssh_clone_url",
      + "github_repository.cdktn-provider-time_repo_3B2224F9.ssh_clone_url",
      + "github_repository.cdktn-provider-tls_repo_49C93FD1.ssh_clone_url",
    ]

```

</details>

*Pusher: @so0k, Action: `pull_request`, Working Directory: ``, Workflow: `Plan`*